/**************************************************************************
 * Rutoken                                                                *
 * Copyright (c) 2020-2021, Aktiv-Soft JSC. All rights reserved.          *
 * Подробная информация:  http://www.rutoken.ru                           *
 *------------------------------------------------------------------------*
 * Данный файл содержит объявление констант для работы с Рутокен в UEFI   *
 * на языке C                                                             *
 *************************************************************************/
#pragma once

/*************************************************************************
 * Включение файлов:                                                     *
 *  - Uefi.h - для доступа к объявлению типов данных UEFI                *
 ************************************************************************/
#include <Uefi.h>

/* DEMO PIN-код Пользователя Рутокен */
static CHAR8 USER_PIN[] = { "12345678" };

#define USER_PIN_LEN (sizeof(USER_PIN) - 1)

/* ID CHV-RSF файла администратора */
#define CKU_ADMIN 1

/* ID CHV-RSF файла пользователя */
#define CKU_USER 2

/* Размер буфера ID токена */
#define TOKEN_ID_SIZE 8