/**************************************************************************
 * Rutoken                                                                *
 * Copyright (c) 2020-2021, Aktiv-Soft JSC. All rights reserved.          *
 * Подробная информация:  http://www.rutoken.ru                           *
 *------------------------------------------------------------------------*
 * Данный файл содержит объявление вспомогательных функций                *
 *************************************************************************/
#pragma once

/*************************************************************************
 * Включение файлов:                                                     *
 *  - Uefi.h - для доступа к объявлению типов данных UEFI                *
 ************************************************************************/
#include <Uefi.h>

/**************************************************************************
 * Функция ожидания нажатия какой-либо кнопки                             *
 *************************************************************************/
void Pause(IN CONST CHAR16 *Msg);
